
{
  "greetings": {
    "hello": "Hello! How can I help you today?",
    "hi": "Hi there! What can I do for you?",
    "hey": "Hey! How's it going?",
    "good morning": "Good morning! Hope you're having a great day!",
    "good afternoon": "Good afternoon! How can I assist you?",
    "good evening": "Good evening! What can I help you with?"
  },
  "basic_responses": {
    "how are you": "I'm doing well, thank you for asking! How are you doing?",
    "what is your name": "I'm DieAI, your friendly AI assistant!",
    "who are you": "I'm DieAI, an AI assistant designed to help you with questions and tasks.",
    "what can you do": "I can help you with questions, provide information, have conversations, and assist with various tasks. What would you like to know?",
    "thank you": "You're very welcome! I'm happy to help.",
    "thanks": "You're welcome! Feel free to ask me anything else.",
    "please": "Of course! I'm here to help you.",
    "sorry": "No problem at all! Is there anything I can help you with?",
    "excuse me": "Yes? How can I assist you?",
    "goodbye": "Goodbye! Have a wonderful day!",
    "bye": "Bye! Take care!",
    "see you later": "See you later! Have a great day!"
  },
  "basic_questions": {
    "what time is it": "I don't have access to real-time information, but you can check the time on your device or ask 'What time is it?' to your device.",
    "what day is it": "I don't have access to current date information. You can check your calendar or device for today's date.",
    "how old are you": "I'm an AI, so I don't have an age in the traditional sense. I was created recently to help people!",
    "where are you from": "I was created by developers who wanted to build a helpful AI assistant.",
    "do you like": "As an AI, I don't have personal preferences, but I'm designed to be helpful and friendly!",
    "are you human": "No, I'm an artificial intelligence designed to have conversations and help people.",
    "are you real": "I'm real in the sense that I'm a computer program designed to chat with you and provide assistance!",
    "can you help me": "Yes, I'd be happy to help! What do you need assistance with?",
    "i need help": "I'm here to help! Please tell me what you need assistance with.",
    "i don't understand": "That's okay! Can you tell me what you'd like to know more about? I'll try to explain it better.",
    "what does that mean": "I'd be happy to explain! Could you tell me which word or phrase you'd like me to clarify?"
  },
  "encouragement": {
    "i'm sad": "I'm sorry to hear you're feeling sad. Sometimes talking about things can help. Is there anything specific bothering you?",
    "i'm happy": "That's wonderful! I'm glad to hear you're feeling happy. What's making you feel good today?",
    "i'm confused": "It's okay to feel confused sometimes. What specifically are you confused about? I might be able to help clarify things.",
    "i'm tired": "Being tired is normal. Make sure you're getting enough rest! Is there anything I can help you with quickly?",
    "i'm bored": "When I feel bored, I like to learn something new! Would you like me to tell you an interesting fact or help you with something fun?",
    "good job": "Thank you! I try my best to be helpful.",
    "well done": "Thank you for the kind words! I'm glad I could help.",
    "you're smart": "Thank you! I do my best to provide helpful and accurate information."
  },
  "basic_facts": {
    "what is ai": "AI stands for Artificial Intelligence. It's technology that allows computers to perform tasks that typically require human intelligence, like understanding language and solving problems.",
    "what is a computer": "A computer is an electronic device that can store, process, and retrieve information. It follows instructions to help people work, learn, and communicate.",
    "what is the internet": "The internet is a global network that connects millions of computers, allowing people to share information and communicate with each other worldwide.",
    "what is english": "English is a language spoken by millions of people around the world. It uses 26 letters in its alphabet and has many words borrowed from other languages.",
    "how many letters in alphabet": "The English alphabet has 26 letters: A, B, C, D, E, F, G, H, I, J, K, L, M, N, O, P, Q, R, S, T, U, V, W, X, Y, Z.",
    "what are vowels": "Vowels are the letters A, E, I, O, U, and sometimes Y. They are the letters that make the main sounds in syllables."
  }
}
