{
    "vocab_size": 32000,
    "special_tokens": {
        "<pad>": 0,
        "<unk>": 1,
        "<s>": 2,
        "</s>": 3,
        "<mask>": 4
    },
    "vocab": {
        "<pad>": 0,
        "<unk>": 1,
        "<s>": 2,
        "</s>": 3,
        "<mask>": 4,
        "the": 5,
        "of": 6,
        "and": 7,
        "to": 8,
        "a": 9,
        "in": 10,
        "for": 11,
        "is": 12,
        "on": 13,
        "that": 14,
        "by": 15,
        "this": 16,
        "with": 17,
        "i": 18,
        "you": 19,
        "it": 20,
        "not": 21,
        "or": 22,
        "be": 23,
        "are": 24,
        "from": 25,
        "at": 26,
        "as": 27,
        "your": 28,
        "all": 29,
        "can": 30,
        "had": 31,
        "her": 32,
        "was": 33,
        "one": 34,
        "our": 35,
        "out": 36,
        "day": 37,
        "get": 38,
        "has": 39,
        "him": 40,
        "his": 41,
        "how": 42,
        "man": 43,
        "new": 44,
        "now": 45,
        "old": 46,
        "see": 47,
        "two": 48,
        "who": 49,
        "boy": 50,
        "did": 51,
        "its": 52,
        "let": 53,
        "put": 54,
        "say": 55,
        "she": 56,
        "too": 57,
        "use": 58,
        "what": 59,
        "when": 60,
        "where": 61,
        "will": 62,
        "would": 63,
        "about": 64,
        "after": 65,
        "again": 66,
        "back": 67,
        "could": 68,
        "first": 69,
        "good": 70,
        "great": 71,
        "just": 72,
        "know": 73,
        "like": 74,
        "look": 75,
        "make": 76,
        "may": 77,
        "most": 78,
        "over": 79,
        "such": 80,
        "take": 81,
        "than": 82,
        "them": 83,
        "well": 84,
        "were": 85,
        "work": 86,
        "year": 87,
        "years": 88,
        "ai": 89,
        "model": 90,
        "transformer": 91,
        "attention": 92,
        "neural": 93,
        "network": 94,
        "learning": 95,
        "machine": 96,
        "data": 97,
        "training": 98,
        "text": 99,
        "generate": 100,
        "response": 101,
        "question": 102,
        "answer": 103,
        "chat": 104,
        "conversation": 105,
        "help": 106,
        "assistant": 107,
        "please": 108,
        "thank": 109,
        "hello": 110,
        "hi": 111,
        "yes": 112,
        "no": 113,
        "understand": 114,
        "explain": 115,
        "information": 116,
        "search": 117,
        "find": 118,
        "result": 119,
        "web": 120,
        "internet": 121,
        "api": 122,
        "key": 123,
        "user": 124,
        "system": 125,
        "application": 126,
        "software": 127,
        "program": 128,
        "code": 129,
        "computer": 130,
        "technology": 131,
        "digital": 132,
        "online": 133,
        "service": 134,
        "platform": 135,
        "website": 136,
        "database": 137,
        "server": 138,
        "client": 139,
        "request": 140,
        "http": 141,
        "json": 142,
        "python": 143,
        "flask": 144,
        "torch": 145,
        "pytorch": 146,
        "deep": 147,
        "intelligence": 148,
        "artificial": 149,
        "language": 150
    }
}